//////////////////////////////////////////////////////////////////////////
//
//
//
//	Notes :
//
//	(WAVERIX)(080308) - PartyManager는 계륵이다.
//	손봐도, 그렇지 않아도... 욕먹는다.
//	(WAVERIX)(080309)
//	-	난 졸라리 바보다... 결국 자멸로 가는게 빤히 보이는데, 관례상의 예외처리를 할 수밖에 없는가? ㅠㅠ
//	-	예외 처리가 아닌 추가 기능 구현이라는 긍정적 프로그래밍이 되고자 하지만... ㅠㅠ 울고 싶다.
//	-	확실히 관례상의 예외처리... 쉽다. 졸라 쉽다. 나중에 ... 나도 몰라. 배째! 아~ 싫어진다.
//	-	이렇게 하지 말자고 주장해도... 며칠 날리고 나서야 포기... 나 자신도 잘 안된다.
//	-	좀 더 근본적인 설계 지침에 대한 훈련이 필요하다.
//
//

#include "StdAfx.h"















